In [1]:
import pandas as pd

In [16]:
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
df = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})

In [45]:
df

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [48]:
df.merge(df, left_on='managerId', right_on='id', suffixes=("_emp", "_man"))

,id_emp,name_emp,salary_emp,managerId_emp,id_man,name_man,salary_man,managerId_man
0,1,Joe,70000,3,3,Sam,60000,<NA>
1,2,Henry,80000,4,4,Max,90000,<NA>

In [49]:
df = df.merge(df, left_on='managerId', right_on='id', suffixes=("_emp", "_man"))

In [58]:
df = df[df['salary_emp'] > df['salary_man']][['name_emp']]

In [61]:
df.rename(columns={'name_emp' : 'Employee'})

  Employee
0      Joe